{
  "_meta": {
    "description": "Basic vocabulary for Little Brain local AI processing",
    "version": "1.0.0",
    "language": "mixed_id_en",
    "size": 1000
  },
  
  "_special_tokens": {
    "UNK": 1,
    "PAD": 0,
    "START": 2,
    "END": 3
  },
  
  "_emotions_id": {
    "senang": 100,
    "sedih": 101,
    "marah": 102,
    "cemas": 103,
    "bahagia": 104,
    "kecewa": 105,
    "excited": 106,
    "tenang": 107,
    "gelisah": 108,
    "gembira": 109,
    "frustrasi": 110,
    "stress": 111,
    "santai": 112,
    "khawatir": 113,
    "bosan": 114,
    "semangat": 115
  },
  
  "_emotions_en": {
    "happy": 120,
    "sad": 121,
    "angry": 122,
    "anxious": 123,
    "excited": 124,
    "calm": 125,
    "worried": 126,
    "glad": 127,
    "frustrated": 128,
    "nervous": 129,
    "peaceful": 130,
    "stressed": 131,
    "relaxed": 132,
    "upset": 133,
    "joyful": 134,
    "depressed": 135
  },
  
  "_activities_id": {
    "kerja": 200,
    "belajar": 201,
    "olahraga": 202,
    "musik": 203,
    "makan": 204,
    "tidur": 205,
    "bermain": 206,
    "membaca": 207,
    "menulis": 208,
    "memasak": 209,
    "belanja": 210,
    "jalan": 211,
    "nonton": 212,
    "diskusi": 213,
    "meeting": 214,
    "presentasi": 215
  },
  
  "_activities_en": {
    "work": 220,
    "study": 221,
    "exercise": 222,
    "music": 223,
    "eat": 224,
    "sleep": 225,
    "play": 226,
    "read": 227,
    "write": 228,
    "cook": 229,
    "shop": 230,
    "walk": 231,
    "watch": 232,
    "discuss": 233,
    "meeting": 234,
    "present": 235
  },
  
  "_common_id": {
    "saya": 300,
    "hari": 301,
    "ini": 302,
    "yang": 303,
    "dan": 304,
    "dengan": 305,
    "untuk": 306,
    "dari": 307,
    "di": 308,
    "ke": 309,
    "pada": 310,
    "akan": 311,
    "sudah": 312,
    "belum": 313,
    "sedang": 314,
    "sangat": 315,
    "lebih": 316,
    "paling": 317,
    "juga": 318,
    "bisa": 319,
    "harus": 320,
    "ingin": 321,
    "mau": 322,
    "perlu": 323,
    "bagus": 324,
    "buruk": 325
  },
  
  "_common_en": {
    "I": 350,
    "me": 351,
    "my": 352,
    "you": 353,
    "your": 354,
    "we": 355,
    "our": 356,
    "they": 357,
    "their": 358,
    "the": 359,
    "and": 360,
    "or": 361,
    "but": 362,
    "for": 363,
    "with": 364,
    "from": 365,
    "to": 366,
    "in": 367,
    "on": 368,
    "at": 369,
    "by": 370,
    "of": 371,
    "is": 372,
    "am": 373,
    "are": 374,
    "was": 375,
    "were": 376,
    "have": 377,
    "has": 378,
    "had": 379,
    "will": 380,
    "would": 381,
    "can": 382,
    "could": 383,
    "should": 384,
    "must": 385,
    "very": 386,
    "more": 387,
    "most": 388,
    "good": 389,
    "bad": 390,
    "today": 391,
    "now": 392,
    "here": 393,
    "there": 394
  },
  
  "_time_id": {
    "pagi": 400,
    "siang": 401,
    "sore": 402,
    "malam": 403,
    "kemarin": 404,
    "besok": 405,
    "minggu": 406,
    "bulan": 407,
    "tahun": 408,
    "jam": 409,
    "menit": 410,
    "detik": 411
  },
  
  "_time_en": {
    "morning": 420,
    "afternoon": 421,
    "evening": 422,
    "night": 423,
    "yesterday": 424,
    "tomorrow": 425,
    "week": 426,
    "month": 427,
    "year": 428,
    "hour": 429,
    "minute": 430,
    "second": 431
  },
  
  "_tech_terms": {
    "programming": 500,
    "coding": 501,
    "flutter": 502,
    "dart": 503,
    "mobile": 504,
    "app": 505,
    "development": 506,
    "software": 507,
    "technology": 508,
    "computer": 509,
    "internet": 510,
    "website": 511,
    "database": 512,
    "server": 513,
    "algorithm": 514,
    "machine": 515,
    "learning": 516,
    "artificial": 517,
    "intelligence": 518,
    "data": 519,
    "analysis": 520
  }
}
